10/data/attachments/c32f2f92982c0352.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d5a9c198-a2c1-4b20-afbb-b427d7cda18d</nif:username>
            <nif:friendToBeAdded>Craig_wait_Actions_70931_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>